// задайте одномерный массив из 123 случайных чисел. 
//Найдите количество элементов массива, значения которрых лежат в отрезке [10,99]
Console.WriteLine("Hello, World!");
