//Задача 0. Квадрат числа

Console.WriteLine("Введите целое число");

int number=Convert.ToInt32(Console.ReadLine());
int result;
result = number*number;
Console.WriteLine($" Квадрат {number} = {result}");
