// Задайте массив. Напишите программу которая определяет присутствует ли
// данное число в массиве.
Console.WriteLine("Hello, World!");
